<script lang="ts" setup>
const goodsList = [
  {
    id: 1,
    name: "Трепанг на меду",
    price: 2899,
    url: "https://www.wildberries.ru/catalog/205460593/detail.aspx?targetUrl=MS&size=330205982",
    src: "/images/goods/dp1.webp",
    alt: "Трепанг на меду",
    size: { width: 227, height: 302 },
    description:
      "Компания «Доктор Панг» ИП Вороной С.В.  разработала новый рецепт ферментативного ",
    specs: [
      "Очень эффективен при мужской половой слабости (импотенции), при лечении воспалений мочеполовой системы",
      "Усиливает либидо у женщин",
      "Повышает сопротивляемость организма и жизненный тонус, активизирует иммунную систему",
      "Снимает недомогания, явления общей интоксикации",
      "Оказывает сильное антиоксидантное действия",
      "Стимулирует регенеративные процессы, омолаживает ткани",
      "Нормализует артериальное заболевание и работу сердечно сосудистой системы, восстанавливает эластичность сосудов",
    ],
  },
  {
    id: 2,
    name: "Трепанг в капсулах",
    price: 4900,
    url: "https://www.wildberries.ru/catalog/197867104/detail.aspx?targetUrl=MS&size=320734553",
    src: "/images/goods/dp2.webp",
    alt: "трепанг в капсулах",
    size: { width: 227, height: 302 },
    description:
      "Трепанг на меду отлично укрепляет иммунитет, эффективно борется с вирусными заболеваниями и инфекциями; Снижает воспалительные процессы и интоксикации различного происхождения; Нормализует артериальное давление, благотворно влияя на сосуды, очищая и укрепляя их;.",
    specs: [
      "Восстанавливает и нормализует потенцию;",
      "Эффективно помогает при различных болезнях мочеполовой системы;",
      "Предотвращает возможность появления различных заболеваний сердца, сосудов",
      "Трепанг на меду необходимо принимать при работе с вредным производством",
      "Ускоряет вывод токсинов и опасных радионуклидов",
    ],
  },
];
</script>

<template>
  <main>
    <AppHero />
    <section class="px-5 pt-3 pb-5">
      <h2 class="text-2xl pb-2">Наши товары</h2>
      <UDivider />
      <CardList />
    </section>
  </main>
</template>

<style scoped></style>
