<script setup>
const aboutTrepang = [
  {
    id: 1,
    label: "ЧЕМ ПОЛЕЗЕН ТРЕПАНГ?",
    content:
      "Количество белков, жиров, углеводов на 100 гр трепанга: Б: 7,3 гр, Ж: 0,6 гр, У: 0 гр. Ккал: 34",
    list: [
      "В процентном соотношении мясо трепанга состоит из белка на 97%, жиров на 3%, углеводов нет вообще. Поступаемые в организм белки в свою очередь содержат аминокислоты и протеины, которые являются важным строительным материалом для мышечных клеток. Особенно нуждаются в них сердечные мышцы. Также белки способствуют регенерации кожи, соединительной ткани, мышечной ткани, росту новых волос и здоровых ногтей.",
      "Жир трепанга содержит большое количество ценных ненасыщенных жирных кислот (НЖК), фосфатидов.",
      "НЖК (омега-9, омега-6, омега-3) играют огромную роль в образовании простагландинов, синтезе жиров и метаболизме холестерина. Стимулируют иммунную защиту человека, способствуют более быстрому заживлению ран, оказывают антигистаминный и противовоспалительный эффект. Большинство НЖК является незаменимыми для человека, наш организм их практически не вырабатывает, поэтому важно обеспечить их поступление извне. И лучше из натуральных продуктов, а не из химических препаратов.",
      "Фосфатиды также не образуются у человека самостоятельно, а они крайне необходимы для нормальной работы многих органов и систем. Фосфатиды обеспечивают жизнедеятельность и регенерацию поврежденных клеток сердца, печени, кожи, нервной системы и других, они:",
    ],
    description: null,
  },
  {
    id: 2,
    label: "КАКИЕ ЕЩЕ ПОЛЕЗНЫЕ ВЕЩЕСТВА СОДЕРЖИТ ТРЕПАНГ?",
    content:
      "Компанией Доктор Панг проведен подробный лабораторный анализ на наличие в дальневосточном трепанге витаминов, микроэлементов, полезных веществ. В трепанге обнаружено более 15-и витаминов, основные из них:",
    list: [
      "Провитамин А, минеральные вещества",
      "Витамин С (аскорбиновая кислота)",
      "Витамин В1 (тиамин)",
      "Витамин В2 (рибофлавин)",
      "Витамин В3 (никотиновая кислота), он же вит. РР",
      "Витамин В5 (пантотеновая кислота)",
      "Витамин В6 (пиридоксин)",
      "Витамин В9 (фолиевая кислота)",
      "Витамин В12 (цианкоболамин)",
      "Витамин F (фосфор)",
    ],
    description: [
      "Витамин А. Найденный в трепанге провитамин А является мощным антиоксидантом. Он обеспечивает нормальный обмен веществ, выводит свободные радикалы, замедляет старение и разрушение клеток. Участвует в иммунном ответе, необходим для здоровья глаз, кожи, формирования зубов и костей.",
      "Витамин С – мощный антиоксидант. Участвует в окислительно-восстановительных процессах, профилактирует онкологические заболевания, укрепляет иммунитет, участвует в выработке коллагена, укрепляет стенки сосудов, препятствует отложению холестерина на них, способствует выведению солей тяжелых металлов из организма.",
      "Витамин B. Здорово, что в трепанге обнаружены практически все витамины группы В. Они работают в организме вместе и усиливают действие друг друга. Это водорастворимые витамины, они не вырабатываются и не накапливаются в организме человека, поэтому должны ежедневно поступать с пищей.",
      "Их основная роль: необходимы для работы нервной системы, помогают бороться со стрессом, придают энергию, поддерживают нормальную работу пищеварительной системы, стабилизируют уровень сахара в крови, участвуют в иммунной защите.",
      "Витамин F. Жирорастворимый витамин F необходим для метаболизма холестерина, синтеза жиров, нормального функционирования иммунной системы, защищает клетки от вредного воздействия окружающей среды, предотвращая образование рака, снижает риск развития инфаркта миокарда, инсульта, стабилизирует артериальное давление, улучшает состояние волос и кожи.",
    ],
  },
  {
    id: 3,
    label: "ПРИМЕНЕНИЕ ТРЕПАНГА",
    content: null,
    list: [
      "Трепанг способствует нормализации веса;",
      "Регенерирует, очищает клетки кожи;",
      "Помогает в лечении новообразований доброкачественных и злокачественных, эрозий, различных воспалений;",
      "Борется с вирусом герпеса;",
      "Повышает потенцию;",
      "Трепанг помогает при болезнях мочеполовой системы;",
      "Препятствует заболеваниям сердца, сосудов;",
      "Ускоряет вывод токсинов, шлаков, радионуклидов;",
      "Восстанавливает мышечную ткань;",
      "Трепанг положительно влияет на органы зрения, предотвращает образование катаракты.",
    ],
    description: null,
  },
  {
    id: 4,
    label: "ПОЛЕЗНЫЕ И ЛЕЧЕБНЫЕ СВОЙСТВА ТРЕПАНГА",
    content:
      "Если Вы часто болеете простудными заболеваниями, Вам нужно восстановиться после операции или химиотерапии попробуйте Доктор Панг.",
    list: [
      "Иммуностимулирующее – укрепляет иммунитет;",
      "Антибактериальное — борется с бактериями, снижает воспалительные процессы в органах;",
      "Ранозаживляющее – способствует регенерации клеток;",
      "Антиоксидантное – снижает риск развития злокачественных новообразований, омолаживает;",
      "Антигрибковое – борется с грибковой инфекцией.",
    ],
    description: null,
  },
];
</script>

<template>
  <section class="px-5 pt-3 pb-5 flex flex-col gap-4">
    <h1 class="text-2xl">Что такое трепанг ?</h1>
    <UDivider />
    <p>
      Многие слышали о полезных свойствах трепанга, однако не все до конца
      понимают, что такое трепанг. Все о дальневосточном трепанге Вы найдете в
      этой статье. Давайте подробнее разберем чем полезен трепанг и как его
      использовать для здоровья человека.
    </p>
    <p>
      <span class="font-bold">Apostichopus japonicus</span> с латинского
      обозначает дальневосточный трепанг – это моллюск класса Голотурии, тип
      Иглокожие. Живет и размножается в водах следующих морей: Желтое,
      Восточно-китайское, Японское, Охотском море. Находят его на глубине до 150
      м. Продолжительность жизни 10-11 лет, за это время трепанг может достигать
      длины тела до 43 см, ширины до 9-10 см, массы 1,3-1,5 кг.
    </p>
    <p>
      Трепанг — это уникальный моллюск. Он не только очень красивый, но и очень
      ценный по своему составу.
    </p>
    <UAccordion class="pt-2" :items="aboutTrepang"
      ><template #item="{ item }">
        <div class="flex flex-col gap-2">
          <p class="italic text-gray-900 pl-4">
            {{ item.content }}
          </p>
          <ul class="pl-10 list-disc">
            <li v-for="list in item.list" :key="list">
              {{ list }}
            </li>
          </ul>
          <ul class="pl-10 list-decimal flex flex-col gap-2">
            <li v-for="list in item.description" :key="list">
              {{ list }}
            </li>
          </ul>
        </div>
      </template>
    </UAccordion>
  </section>
  <section class="px-5 pt-3 pb-5 flex flex-col gap-4">
    <h2 class="text-2xl">Ферментативный гидролизат трепанга в капсулах</h2>
    <UDivider />
    <p>
      <span class="font-bold"> Состав:</span> Трепанг дальневосточный, продукт
      содержит магний, калий, фосфор, хром, цинк,меди, железа и кальция, более
      40 элементов таблицы Менделеева, каждый из которых входит в состав клеток
      и тканей человека, участвует в обменных процессах и образовании гормонов,
      ферментов; витамины С, В12, тиамин, рибофлавин, гликозиды, простагландины,
      стероидные соединения, нейротоксины, фосфолипиды и гликолипиды.
    </p>
    <p>
      <span class="font-bold">Форма выпуска: </span>
      желатиновые капсулы во флаконах по 30шт, 60шт,90шт,таблетки во флаконах по
      30 шт, 90шт. Свойства: Голотурин мощное цитостатическое действие
      голотуринов обусловлено образованием комплексов с холестерином,
      разрушающих мембраны быстрорастущих опухолевых клеток. Обладают сильным
      антимитозным действием за счет влияния на синтез белковых макромолекул и
      коллоидную структуру протоплазмы клеток. Наиболее ценным биологическим
      свойством голотурина является его способность ингибировать рост некоторых
      злокачественных новообразований.
    </p>
    <p>
      <span class="font-bold">Липиды</span>
      активируют окислительно-восстановительные процессы организма, снижают
      уровень холестерина низкой плотности, вызывающего атеросклероз.
    </p>
    <p>
      <span class="font-bold">Тритерпеновые гликозиды</span>
      обладают выраженным противовирусным, антибактериальным, противогрибковым
      эффектом.
    </p>
    <p>
      <span class="font-bold">Стероидные гликозиды</span>
      угнетают клеточное деление злокачественной опухоли.
    </p>
    <p>
      <span class="font-bold">Сердечные гликозиды</span>
      обладают противовирусным, антибактериальным, противогрибковым эффектом.
      Они способны купированию спазмов кровеносных сосудов, мышц, усилению
      сократительной способности сердца, что удлиняет время отдыха миокарда. не
      более 75%. Информация изготовителя ИП Вороной С.В.
    </p>
    <p>
      <span class="font-bold">Кальций</span>
      в двухвалентной органической форме основная составная часть
      опорно-двигательного аппарата, ногтей, волос, еще является главным
      клеточным перевозчиком веществ.
    </p>
    <p>
      <span class="font-bold">Фосфор </span>
      незаменимый элемент наших аккумуляторов АТФ, НАДФ, потому способствует
      активизации клеточного обмена. Входит в состав большинства ферментов
      мозга. Способствует улучшению интеллектуальных способностей.
    </p>
    <p>
      <span class="font-bold">Цинк</span>
      входит в состав гормонов гипофиза, половых желез, поджелудочной железы.
    </p>
    <p>
      <span class="font-bold">Медь</span>
      активизирует кроветворение, имеет антибактериальное действие и потому
      способствует устранению воспалительных процессов.
    </p>
    <p>
      <span class="font-bold">Двухвалентный селен</span>
      при пониженном содержании селена возникают всевозможные нарушения в
      организме, приводящие к инфаркту, инсульту, миокардиодистрофии, язвенной
      болезни двенадцатиперстной кишки, вирусным, гормональным, инфекционным,
      генетическим и другим заболеваниям.
    </p>
    <p>
      <span class="font-bold">Германий</span>
      входит в состав антиоксидантов и соединений с антираковыми свойствами.
      Кобальт профилактор злокачественного малокровия.
    </p>
    <p>
      <span class="font-bold">Витамин В1</span>
      превращает углеводы в энергию, участвует в метаболизме кислот, укрепляет
      нервную систему, способствует регенерации нервов, повышению иммунитета.
    </p>
    <p>
      <span class="font-bold">Витамин В</span>
      защищает кожу и слизистые оболочки от воспалений. Предотвращает
      дистрофические изменения надпочечников и других гормональных желез.
    </p>
    <UDivider />
    <UAlert color="green" title="Рекомендации по применению:">
      <template #description>
        <p>
          Принимать по 1 капсуле, 2-3 раза в день,после еды. Рекомендован для
          ежедневного приема. После одного месяца приема «Доктора Панга»
          рекомендуется сделать 1-2 неделю перерыв, затем его можно продолжить
          принимать.
        </p>
      </template>
    </UAlert>

    <UAlert color="red" title="ПРОТИВОПОКАЗАНИЯ:">
      <template #description>
        <p>
          БЕРЕМЕННОСТЬ, ЛАКТАЦИОННЫЙ ПЕРИОД, ВОЗРАСТ ДО 18 ЛЕТ, ИНДИВИДУАЛЬНАЯ
          НЕПЕРЕНОСИМОСТЬ.
        </p>
      </template>
    </UAlert>
    <UDivider />
    <p>
      Срок годности 12 мес. Хранить при температуре от 0С до 25С и относительной
      влажности
    </p>
    <span>Информация изготовителя ИП Вороной С.В</span>
  </section>
</template>

<style scoped></style>
